In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\sajjad sindhi\appdata\local\anaconda3\lib\site-packages (1.5.3)
Requirement already satisfied: pytz>=2020.1 in c:\users\sajjad sindhi\appdata\local\anaconda3\lib\site-packages (from pandas) (2022.7)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\sajjad sindhi\appdata\local\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.21.0 in c:\users\sajjad sindhi\appdata\local\anaconda3\lib\site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in c:\users\sajjad sindhi\appdata\local\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [3]:
import pandas as pd


var = pd.Series([1,2,3,4,5,6])

var

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [5]:
var = pd.DataFrame([[1,2,3,4,5,6,7]])

var

   0  1  2  3  4  5  6
0  1  2  3  4  5  6  7

In [6]:
import pandas

mydataset = {
  'cars': ["BMW", "Volvo", "Ford"],
  'passings': [3, 7, 2]
}

myvar = pandas.DataFrame(mydataset)

print(myvar)

    cars  passings
0    BMW         3
1  Volvo         7
2   Ford         2

In [7]:
import pandas as pd

a = [1, 7, 2]

myvar = pd.Series(a, index = ["x", "y", "z"])

print(myvar)

x    1
y    7
z    2
dtype: int64

In [10]:
import numpy as np

data = np.random.randint(1,100,size=(5,4))

data = pd.DataFrame(data)

data

    0   1   2   3
0  89  86  24  27
1  21  75  50  47
2  34  82  10   1
3  98  79   8  24
4  49  22  64  49

In [14]:
rows_index = [['sindh','sindh','punjab','punjab'],
             ['karachi','hyderabad','lahore','faisalabad']
             ]

data = (200,300,150,175)

df = pd.DataFrame(data,columns=['Not of Students'],index=rows_index)

df

                   Not of Students
sindh  karachi                 200
       hyderabad               300
punjab lahore                  150
       faisalabad              175